import pandas as pd
import pytest


@pytest.fixture
def data():
    return {
        "Дата платежа": ["01.01.2021", "15.01.2021", "20.01.2021", "25.01.2021"],
        "Категория": ["Супермаркеты", "Супермаркеты", "Развлечения", "Супермаркеты"],
        "Сумма платежа": [-100, -200, -150, -50]
    }


@pytest.fixture
def data_views():
    data = pd.DataFrame({
        "Номер карты": ["*1234", "*5678"],
        "Сумма операции": [100, 200],
        "Категория": ["Еда", "Транспорт"]
    })
    return data


@pytest.fixture
def data_views_expenses():
    data = {
        "Номер карты": ["*1234", "*5678", "*1234", "*5678", "*9101"],
        "Сумма операции": [-100, -200, -50, -300, -150]
    }
    df = pd.DataFrame(data)
    return df